Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier.FirstAffectedBar Property
 Gets or sets the first affected bar. If set to zero, the first affected bar will be chosen automatically.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int FirstAffectedBar { get; set; }
Public Property FirstAffectedBar As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
BaseRebarModifier Class
Tekla.Structures.Model Namespace